Revit 2016 API
UIView.Zoom Method
Zoom the view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public void Zoom(
	double zoomFactor
)
Visual Basic
Public Sub Zoom ( _
	zoomFactor As Double _
)
Visual C++
public:
void Zoom(
	double zoomFactor
)
Parameters
zoomFactor
Type: System.Double
Factor by which to zoom in or out. Values greater than 1 zooms in, less than 1 zooms out.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | zoomFactor is not positive.
Autodesk.Revit.Exceptions.InvalidOperationException | The view is not a graphical view.
See Also
UIView Class
Autodesk.Revit.UI Namespace